## Pandas Introduction:
- Developed in 2008 by mckiney.
- Used for analyzing, cleaning, exploring and manipulating data.

## Pandas can do
- finding the correlation.
- handling with missing values.
- avg, max, min.
- plotting.

In [2]:
pip install pandas

Requirement already satisfied: pandas in c:\users\bhagy\anaconda3\lib\site-packages (1.2.4)
Requirement already satisfied: pytz>=2017.3 in c:\users\bhagy\anaconda3\lib\site-packages (from pandas) (2021.1)
Requirement already satisfied: numpy>=1.16.5 in c:\users\bhagy\anaconda3\lib\site-packages (from pandas) (1.20.1)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\bhagy\anaconda3\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: six>=1.5 in c:\users\bhagy\anaconda3\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)
Note: you may need to restart the kernel to use updated packages.

In [3]:
import pandas
pandas.__version__

'1.2.4'

In [4]:
import pandas as pd

## Series

- list
- tuple
- numpy array

In [5]:
s1 = pd.Series([1, 2, 3, "apssdc"])
print(s1)
print(type(s1))

0         1
1         2
2         3
3    apssdc
dtype: object
<class 'pandas.core.series.Series'>

In [6]:
## series object with list format.

s1 = pd.Series([1, 2, 3, "apssdc"], index = ['x1', 'x2', 'x3', 'x4'])
print(s1)
print(type(s1))

x1         1
x2         2
x3         3
x4    apssdc
dtype: object
<class 'pandas.core.series.Series'>

In [7]:
## series object with tuple format.

s2 = pd.Series((1, 2, 3, 4))
print(s2)
s2.index=[11, 12, 13, 14]
s2

0    1
1    2
2    3
3    4
dtype: int64

11    1
12    2
13    3
14    4
dtype: int64

In [8]:
## series object with numpy format.

import numpy as np
s3 = pd.Series(np.arange(1, 10))
print(s3)
print(type(s3))

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int32
<class 'pandas.core.series.Series'>

In [9]:
s1.index

Index(['x1', 'x2', 'x3', 'x4'], dtype='object')

In [10]:
s3.index

RangeIndex(start=0, stop=9, step=1)

In [11]:
s1

x1         1
x2         2
x3         3
x4    apssdc
dtype: object

In [12]:
s1['x2']

2

In [13]:
s1['x1'], s1['x4']

(1, 'apssdc')

In [14]:
s1['x1'],s2[12]

(1, 2)

In [15]:
s3.min()

1

In [16]:
s3.cumsum()

0     1
1     3
2     6
3    10
4    15
5    21
6    28
7    36
8    45
dtype: int32

## pandas date_range
- to work with date and time formates, we can use date_range.
- pandas.date_range()

In [17]:
import pandas as pd
d1 = pd.date_range('01-01-2021', periods=10)

In [18]:
d1

DatetimeIndex(['2021-01-01', '2021-01-02', '2021-01-03', '2021-01-04',
               '2021-01-05', '2021-01-06', '2021-01-07', '2021-01-08',
               '2021-01-09', '2021-01-10'],
              dtype='datetime64[ns]', freq='D')

In [19]:
import pandas as pd
d2 = pd.date_range('01-01-2021', periods=10, freq='1H')
d2

DatetimeIndex(['2021-01-01 00:00:00', '2021-01-01 01:00:00',
               '2021-01-01 02:00:00', '2021-01-01 03:00:00',
               '2021-01-01 04:00:00', '2021-01-01 05:00:00',
               '2021-01-01 06:00:00', '2021-01-01 07:00:00',
               '2021-01-01 08:00:00', '2021-01-01 09:00:00'],
              dtype='datetime64[ns]', freq='H')

In [20]:
import pandas as pd
d2 = pd.date_range('01-01-2021', periods=20, freq='24h')
d2

DatetimeIndex(['2021-01-01', '2021-01-02', '2021-01-03', '2021-01-04',
               '2021-01-05', '2021-01-06', '2021-01-07', '2021-01-08',
               '2021-01-09', '2021-01-10', '2021-01-11', '2021-01-12',
               '2021-01-13', '2021-01-14', '2021-01-15', '2021-01-16',
               '2021-01-17', '2021-01-18', '2021-01-19', '2021-01-20'],
              dtype='datetime64[ns]', freq='24H')

In [21]:
import pandas as pd
d2 = pd.date_range(start = '01-01-2021', end = '01-02-2021', freq='5s')
d2

DatetimeIndex(['2021-01-01 00:00:00', '2021-01-01 00:00:05',
               '2021-01-01 00:00:10', '2021-01-01 00:00:15',
               '2021-01-01 00:00:20', '2021-01-01 00:00:25',
               '2021-01-01 00:00:30', '2021-01-01 00:00:35',
               '2021-01-01 00:00:40', '2021-01-01 00:00:45',
               ...
               '2021-01-01 23:59:15', '2021-01-01 23:59:20',
               '2021-01-01 23:59:25', '2021-01-01 23:59:30',
               '2021-01-01 23:59:35', '2021-01-01 23:59:40',
               '2021-01-01 23:59:45', '2021-01-01 23:59:50',
               '2021-01-01 23:59:55', '2021-01-02 00:00:00'],
              dtype='datetime64[ns]', length=17281, freq='5S')

In [22]:
date = pd.Series(pd.date_range(start = '01-01-2021', end = '01-02-2021', freq='5s'))
print(date)
print(type(date))

0       2021-01-01 00:00:00
1       2021-01-01 00:00:05
2       2021-01-01 00:00:10
3       2021-01-01 00:00:15
4       2021-01-01 00:00:20
                ...
17276   2021-01-01 23:59:40
17277   2021-01-01 23:59:45
17278   2021-01-01 23:59:50
17279   2021-01-01 23:59:55
17280   2021-01-02 00:00:00
Length: 17281, dtype: datetime64[ns]
<class 'pandas.core.series.Series'>

## Data Frame:
- pandas.DataFrame.
- 2D data type of data.
- list.
- tuple.
- dictionary.
- numpy array.
    - string, floor, complex-string/ object:

In [23]:
import pandas as p1

df1 = p1.DataFrame([[1, 2, 3], [4, 5, "apssdc"]])
df2 = p1.DataFrame((1, 3), (1, 2))
df3 = p1.DataFrame({"k1" : [11, 2], "m1" : [23, 32]})
df4 = p1.DataFrame(np.array([[1, 3, 5], [2, 4, 6]]))

In [24]:
print(df1)
df1

   0  1       2
0  1  2       3
1  4  5  apssdc

   0  1       2
0  1  2       3
1  4  5  apssdc

In [25]:
df2

   0
1  1
2  3

In [26]:
df3

   k1  m1
0  11  23
1   2  32

In [27]:
df4

   0  1  2
0  1  3  5
1  2  4  6

In [28]:
type(df4)

pandas.core.frame.DataFrame

In [29]:
type(df3)

pandas.core.frame.DataFrame

In [30]:
df2 = p1.DataFrame((1, 3), (1, 2), (3, 4))  ## because DataFrame is 2D.
df2

ValueError: Shape of passed values is (2, 1), indices imply (2, 2)

In [31]:
df2 = p1.DataFrame(((1, 3), (1, 2), (3, 4)), index = ['x', 'y', 'z'])

In [32]:
df2

   0  1
x  1  3
y  1  2
z  3  4

In [33]:
df3

   k1  m1
0  11  23
1   2  32

In [34]:
df3.columns = ["column1", "column2"]
df3.index = ["row1", "row2"]

In [35]:
df3

      column1  column2
row1       11       23
row2        2       32

In [36]:
df3.columns

Index(['column1', 'column2'], dtype='object')

In [37]:
df3.index

Index(['row1', 'row2'], dtype='object')

In [38]:
import numpy as np

d1 = {'rollno' : ['18B01A05' + str(i) for i in range(1, 101)], 
      'm1' : np.random.randint(1, 100, 100),
      'm2' : np.random.randint(1, 100, 100),
      'm3' : np.random.randint(1, 100, 100)}  # (start_value, end_value, total_numbers)

df = pd.DataFrame(d1)
df

         rollno  m1  m2  m3
0     18B01A051  80  63   9
1     18B01A052  57  43   2
2     18B01A053  18  95  50
3     18B01A054  41  70   6
4     18B01A055  13  89  89
..          ...  ..  ..  ..
95   18B01A0596  69  12  87
96   18B01A0597  49  22  20
97   18B01A0598  38  70  22
98   18B01A0599  87  30  39
99  18B01A05100  32  12  39

[100 rows x 4 columns]

In [39]:
df.head()

      rollno  m1  m2  m3
0  18B01A051  80  63   9
1  18B01A052  57  43   2
2  18B01A053  18  95  50
3  18B01A054  41  70   6
4  18B01A055  13  89  89

In [40]:
df.tail()

         rollno  m1  m2  m3
95   18B01A0596  69  12  87
96   18B01A0597  49  22  20
97   18B01A0598  38  70  22
98   18B01A0599  87  30  39
99  18B01A05100  32  12  39

In [41]:
df.head(20)

        rollno  m1  m2  m3
0    18B01A051  80  63   9
1    18B01A052  57  43   2
2    18B01A053  18  95  50
3    18B01A054  41  70   6
4    18B01A055  13  89  89
5    18B01A056  34  39   3
6    18B01A057  29  42  12
7    18B01A058  50  80   2
8    18B01A059  86  62  76
9   18B01A0510  43  71  95
10  18B01A0511  84  70  81
11  18B01A0512  15  36  25
12  18B01A0513   1  52  23
13  18B01A0514  53  19  34
14  18B01A0515  67  23  16
15  18B01A0516  37  80  58
16  18B01A0517  36   5  95
17  18B01A0518  81  27  87
18  18B01A0519  88  20  61
19  18B01A0520  65  46  10

In [42]:
df.shape  # number of rows and number of columns

(100, 4)

In [43]:
print(df['rollno'])
print(type(df['rollno']))

0       18B01A051
1       18B01A052
2       18B01A053
3       18B01A054
4       18B01A055
         ...
95     18B01A0596
96     18B01A0597
97     18B01A0598
98     18B01A0599
99    18B01A05100
Name: rollno, Length: 100, dtype: object
<class 'pandas.core.series.Series'>

In [44]:
df[['rollno', 'm1']]

         rollno  m1
0     18B01A051  80
1     18B01A052  57
2     18B01A053  18
3     18B01A054  41
4     18B01A055  13
..          ...  ..
95   18B01A0596  69
96   18B01A0597  49
97   18B01A0598  38
98   18B01A0599  87
99  18B01A05100  32

[100 rows x 2 columns]

## iloc
- Index location.
 ## loc
 - Label names.

In [45]:
df.iloc[0 : 10]

       rollno  m1  m2  m3
0   18B01A051  80  63   9
1   18B01A052  57  43   2
2   18B01A053  18  95  50
3   18B01A054  41  70   6
4   18B01A055  13  89  89
5   18B01A056  34  39   3
6   18B01A057  29  42  12
7   18B01A058  50  80   2
8   18B01A059  86  62  76
9  18B01A0510  43  71  95

In [46]:
df.iloc[0]

rollno    18B01A051
m1               80
m2               63
m3                9
Name: 0, dtype: object

In [47]:
df.iloc[0 : 10][['rollno', 'm1']]

       rollno  m1
0   18B01A051  80
1   18B01A052  57
2   18B01A053  18
3   18B01A054  41
4   18B01A055  13
5   18B01A056  34
6   18B01A057  29
7   18B01A058  50
8   18B01A059  86
9  18B01A0510  43

In [48]:
student_df = df.set_index("rollno")

In [49]:
student_df.head()

           m1  m2  m3
rollno
18B01A051  80  63   9
18B01A052  57  43   2
18B01A053  18  95  50
18B01A054  41  70   6
18B01A055  13  89  89

In [50]:
student_df.loc['18B01A051']

m1    80
m2    63
m3     9
Name: 18B01A051, dtype: int32

In [51]:
student_df.loc['18B01A0567']

m1    63
m2     4
m3    76
Name: 18B01A0567, dtype: int32

In [52]:
student_df.loc['18B01A0545']['m1']

53

In [53]:
student_df.loc['18B01A0545' : '18B01A0550']

            m1  m2  m3
rollno
18B01A0545  53  15  23
18B01A0546  98  40  91
18B01A0547  21   1  34
18B01A0548  64  86  19
18B01A0549  79  84  68
18B01A0550  40  95  30

In [54]:
student_df.loc['18B01A0545' : '18B01A0550'][['m1', 'm2']]

            m1  m2
rollno
18B01A0545  53  15
18B01A0546  98  40
18B01A0547  21   1
18B01A0548  64  86
18B01A0549  79  84
18B01A0550  40  95

In [55]:
student_df["Total_marks"] = student_df.sum(axis = 'columns')
student_df.head()

           m1  m2  m3  Total_marks
rollno
18B01A051  80  63   9          152
18B01A052  57  43   2          102
18B01A053  18  95  50          163
18B01A054  41  70   6          117
18B01A055  13  89  89          191